[
  {
    "category": "Naming",
    "description": "DMS-931: Apply dialect identifier shortening into the derived model (not just collision detection). Today `RelationalModelSetBuilderContext.BuildResult` detects shortening collisions, but the model still stores pre-shortened identifiers, forcing every downstream consumer to remember to shorten consistently. Acceptance: (1) A set-level pass (or the DMS-931 naming pass) rewrites all derived identifiers using `context.DialectRules.ShortenIdentifier` and stores the shortened names in the `DerivedRelationalModelSet` (tables, columns, constraints, indexes, triggers, abstract identity tables/views); (2) all internal references are updated consistently (FK `TargetTable/TargetColumns`, `DocumentReferenceBinding.Table/FkColumn/IdentityBindings`, `DescriptorEdgeSource`, etc.); (3) the pass is deterministic and idempotent (running twice yields the same model); (4) collision detection still fails fast when multiple original identifiers shorten to the same value; (5) unit tests cover a model with overlong names and assert the shortened identifiers are present in the output and referenced correctly by constraints/bindings; (6) all unit tests pass and the DMS solution builds.",
    "steps-to-verify": [
      "Implement a new set-level pass (e.g., `ApplyDialectIdentifierShorteningRelationalModelSetPass`) that rewrites identifiers in-place on `RelationalModelSetBuilderContext` inventories using `DialectRules.ShortenIdentifier` and updates all references consistently.",
      "Register the new pass at the end of `./src/dms/backend/EdFi.DataManagementService.Backend.RelationalModel/RelationalModelSetPasses.cs` (after DMS-931 naming/override application, and after indexes/triggers inventories exist).",
      "Add unit tests that force overlong identifiers (e.g., a UNIQUE constraint name built from many columns) and assert the shortened names are stored in the resulting `DerivedRelationalModelSet` and referenced by FKs/bindings correctly.",
      "Run: `dotnet test --no-restore ./src/dms/backend/EdFi.DataManagementService.Backend.RelationalModel.Tests.Unit/EdFi.DataManagementService.Backend.RelationalModel.Tests.Unit.csproj`",
      "Run: `dotnet build --no-restore ./src/dms/EdFi.DataManagementService.sln`"
    ],
    "completed": false
  },
  {
    "category": "Naming",
    "description": "DMS-931: Implement full `resourceSchema.relational.nameOverrides` semantics (beyond DMS-930 placeholders) and remove temporary restrictions. DMS-930 currently extracts reference-only overrides (or will fail fast on non-reference keys) to avoid silent no-ops. Acceptance: (1) `relational.nameOverrides` keys are parsed/validated using the restricted JSONPath grammar and canonicalization described in `reference/design/backend-redesign/epics/01-relational-model/02-naming-and-overrides.md`; (2) overrides are applied to derived identifiers at the correct stage (before suffixes like `_DocumentId`/`_DescriptorId` and before dialect shortening); (3) unknown override keys fail fast with an exception listing the unknown keys and the owning resource; (4) overrides support scalar/descriptor/reference columns and collection segment naming as specified by the design; (5) override application is deterministic and cannot introduce undetected collisions (collisions fail fast with actionable diagnostics); (6) unit tests cover valid overrides, unknown keys, and collisions introduced by overrides; (7) DMS-930 placeholder enforcement (reference-only extraction/fail-fast for non-reference keys) is removed or revised so there is exactly one authoritative override implementation.",
    "steps-to-verify": [
      "Implement the DMS-931 override parsing + application in the naming pass (or a dedicated pass), consuming raw overrides from schema inputs and applying them to the derived model identifiers before dialect shortening.",
      "Update/replace `ExtractReferenceNameOverrides` behavior in `./src/dms/backend/EdFi.DataManagementService.Backend.RelationalModel/ExtractInputsStep.cs` so DMS-930 placeholder restrictions do not conflict with the full DMS-931 implementation.",
      "Add unit tests covering: (a) scalar column override; (b) reference base name override; (c) collection segment override; (d) unknown override key fails fast; (e) override collision fails fast deterministically.",
      "Run: `dotnet test --no-restore ./src/dms/backend/EdFi.DataManagementService.Backend.RelationalModel.Tests.Unit/EdFi.DataManagementService.Backend.RelationalModel.Tests.Unit.csproj`"
    ],
    "completed": false
  },
  {
    "category": "Naming",
    "description": "DMS-931: Replace verbose constraint naming (`UX_{Table}_{Col1}_{Col2}_...`, `FK_{Table}_{Col1}_{Col2}_...`) with purpose-based names that avoid repeating shared reference prefixes, and append `_{h10}` (first 10 hex of SHA-256 of a canonical constraint signature) only when the resulting name would exceed the target dialect identifier limit (Pgsql 63 bytes, Mssql 128 chars). Acceptance: (1) FK/UK/CK names are derived from the owning table plus stable role tokens (e.g., reference base name, `NK`, `RefKey`, `AllNone`) instead of concatenating the full physical column list; (2) composite reference FKs use a single reference token (no `ReferenceBaseName_` duplication per column); (3) `h10` is present only when required by the dialect max length; otherwise the name contains no hash suffix; (4) hashing uses a canonical signature string that includes at least kind, owning table, ordered local columns, target table, ordered target columns, and referential actions so it is deterministic and collision-resistant; (5) names are deterministic and stable across runs; (6) names are unique post-shortening (collisions fail fast with actionable diagnostics); (7) update the authoritative golden manifest so the unique constraint currently at `./src/dms/backend/EdFi.DataManagementService.Backend.RelationalModel.Tests.Unit/Fixtures/authoritative/sample/expected/authoritative-derived-relational-model-set.json:2456` and the FK at `...:2630` no longer contain duplicated reference prefixes and are within the Pgsql limit; (8) unit tests cover within-limit (no hash) and over-limit (hash) cases for both FK and UK naming.",
    "steps-to-verify": [
      "Introduce a constraint naming service/helper that generates a short, semantic base name per constraint kind/purpose and only appends `_{h10}` when the dialect max identifier length would be exceeded.",
      "Update all constraint derivation code to use the new naming strategy (e.g., `RelationalNameConventions.ForeignKeyName(...)`, `ConstraintDerivationHelpers.BuildUniqueConstraintName(...)`, and any check-constraint naming helpers).",
      "Update `reference/design/backend-redesign/design-docs/data-model.md` constraint naming section to match the implemented strategy (purpose tokens + optional length-driven `h10`).",
      "Update the authoritative golden fixture and add unit tests asserting the example constraints no longer repeat reference prefixes and that `h10` is absent when the base name is within the dialect limit.",
      "Run: `dotnet test --no-restore ./src/dms/backend/EdFi.DataManagementService.Backend.RelationalModel.Tests.Unit/EdFi.DataManagementService.Backend.RelationalModel.Tests.Unit.csproj`",
      "Run: `dotnet build --no-restore ./src/dms/EdFi.DataManagementService.sln`"
    ],
    "completed": false
  }
]
